app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "hasan"], ["email", "hasan@mail.com"], ["password", "111111111111111111111"], ["created_at", "2020-07-02 14:48:44.457406"], ["updated_at", "2020-07-02 14:48:44.457406"]]
---
  def create
    # @user = User.new(username: params[:username], email: params[:email], password: params[:password])
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "hasan"], ["password", "hjkhjkhj"], ["updated_at", "2020-07-06 08:20:50.062162"], ["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
      flash[:info] = ['The user is edited successfully.']
      @user = User.find(params[:id]).update user_params